In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [15]:
n_rows = 5
n_cols = 5 
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows, n_cols)),
                 columns=cols)
df

    A   B   C   D   E
0   1   9   9   3  18
1  11   2  16   5  19
2   1  10  15   2  14
3  19   7   2   1   7
4  13   1  13  18   2

In [20]:
df.query('A > 10')

    A  B   C   D   E
1  11  2  16   5  19
3  19  7   2   1   7
4  13  1  13  18   2

In [21]:
rerata = df['A'].mean()
rerata

9.0

In [22]:
df.query('A > @rerata')

    A  B   C   D   E
1  11  2  16   5  19
3  19  7   2   1   7
4  13  1  13  18   2